granel2/stm32f407vg_lan_tft/Core/Src/main.c
  if ((int32_t)(HAL_GetTick() - next_tick) < 0)
  {
    return;
  }

  HAL_GPIO_WritePin(leds[current].port, leds[current].pin, GPIO_PIN_RESET);
  current = (uint8_t)((current + 1U) % 6U);
  HAL_GPIO_WritePin(leds[current].port, leds[current].pin, GPIO_PIN_SET);
  next_tick = HAL_GetTick() + 200U;
}

/**
  * @brief  Bring up lwIP and the Ethernet netif (DHCP, no static IP).
  */
static void MX_LWIP_Init(void)
{
  ip4_addr_t ipaddr, netmask, gw;

  g_eth_debug_marker = 50;
  lwip_init();
  g_eth_debug_marker = 51;

  /* All zero: ethernetif_init()/dhcp_start() will fill the real address in. */
  IP4_ADDR(&ipaddr, 0, 0, 0, 0);
  IP4_ADDR(&netmask, 0, 0, 0, 0);
  IP4_ADDR(&gw, 0, 0, 0, 0);

  netif_add(&gnetif, &ipaddr, &netmask, &gw, NULL, &ethernetif_init, &ethernet_input);
  g_eth_debug_marker = 52;
  netif_set_default(&gnetif);
  netif_set_status_callback(&gnetif, netif_status_callback);
  g_eth_debug_marker = 53;

  if (netif_is_link_up(&gnetif))
  {
    netif_set_up(&gnetif);
    dhcp_start(&gnetif);
    g_eth_debug_marker = 54;
    Debug_Print("[lwip] link up, DHCP started\r\n");
  }
  else
  {
    netif_set_down(&gnetif);
    Debug_Print("[lwip] link down at startup, will retry via ethernetif_poll_link()\r\n");
  }
}

/**
  * @brief  Fires whenever the netif's flags/IP change - in particular once
  *         DHCP hands us a lease. Prints the address so it shows up on the
  *         debug UART (USART1, 921600 baud) without needing a debugger.
  */
static void netif_status_callback(struct netif *netif)
{
  if (netif_is_up(netif) && !ip4_addr_isany_val(*netif_ip4_addr(netif)))
  {
    char msg[64];
    snprintf(msg, sizeof(msg), "[lwip] IP: %s\r\n", ip4addr_ntoa(netif_ip4_addr(netif)));
    Debug_Print(msg);
  }
}

static void Debug_Print(const char *msg)
{
  HAL_UART_Transmit(&huart1, (uint8_t *)msg, (uint16_t)strlen(msg), 100);
}

/**
  * @brief  SPI3 master for the ST7796S TFT. APB1 = 40 MHz, prescaler /4 ->
  *         10 MHz SCK: comfortably inside the controller's write timing and
  *         slow enough for RDID readback over the module's SDA-O line. Once
  *         the panel is confirmed working, /2 (20 MHz) is worth trying for
  *         faster full-screen fills. Software CS (PA15 GPIO), mode 0.
  */
static void MX_SPI3_Init(void)
{
  hspi3.Instance = SPI3;
  hspi3.Init.Mode = SPI_MODE_MASTER;
  hspi3.Init.Direction = SPI_DIRECTION_2LINES;
  hspi3.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi3.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi3.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi3.Init.NSS = SPI_NSS_SOFT;
  hspi3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;
  hspi3.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi3.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi3.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi3.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi3) != HAL_OK)
  {
    Error_Handler();
  }
}

/* Layout of the bring-up screen (portrait, 320x480). The test pattern's
   bottom-right quarter is a plain grey block - the live counters go there. */
#define TFT_CNT_X       166U   /* left edge of the 5-digit counters */
#define TFT_CNT_DIGIT_W  24U
#define TFT_CNT_DIGIT_H  40U
#define TFT_UPTIME_Y    300U   /* seconds since boot */
#define TFT_FRAME_MS_Y  360U   /* measured full-screen fill time, ms */
#define TFT_BLINK_X     170U   /* 40x40 square toggling every second (= pattern's red square) */
#define TFT_BLINK_Y     250U
#define TFT_GREY        ST7796S_RGB(64, 64, 64)

static uint32_t tft_frame_ms;  /* last measured full-screen fill, for the log/screen */

/**
  * @brief  One-shot TFT hardware check at boot. Everything here is blocking
  *         (~7 s) - runs before lwIP on purpose. What to look for:
  *         UART : "[tft] id ..." verdict, full-frame fill time in ms
  *         panel: solid red -> green -> blue -> white (0.4 s each), then the
  *                test pattern rotated through all 4 orientations (0.8 s
  *                each), finally portrait with two counters bottom-right.
  */
static void TFT_SmokeTest(void)
{
  static const uint16_t fills[4] = { ST7796S_RED, ST7796S_GREEN, ST7796S_BLUE, ST7796S_WHITE };
  uint8_t id[4];
  uint32_t t0, id24;
  char msg[128];

  ST7796S_Init(&hspi3);

  /* 1. Link check via RDID4. Needs SDA-O -> PC11; without it the bus reads
     back all-0 or all-1, which is reported as such rather than as a fault.
     A 1-bit left shift of the reply is normal for 4-wire SPI reads. */
  ST7796S_ReadID(id);
  id24 = ((uint32_t)id[1] << 16) | ((uint32_t)id[2] << 8) | id[3];
  snprintf(msg, sizeof(msg), "[tft] RDID4(0xD3) = %02X %02X %02X %02X -> %s\r\n",
           id[0], id[1], id[2], id[3],
           ((id[0] & id[1] & id[2] & id[3]) == 0xFFU) ? "bus idle high: SDA-O not wired or no power" :
           ((id[0] | id[1] | id[2] | id[3]) == 0x00U) ? "all zero: SDA-O not wired or panel not answering" :
           (id24 == 0x007796U)                       ? "ST7796S confirmed" :
           (((id24 >> 1) & 0xFFFFFFU) == 0x007796U)  ? "ST7796S confirmed (1-bit shifted reply)" :
                                                       "unexpected ID - other controller or bad wiring");
  Debug_Print(msg);

  /* 2. Colour check + throughput: time one full-screen fill (307 200 B).
     Expect ~250 ms at 10 MHz SCK, ~125 ms at 20 MHz. */
  for (uint8_t i = 0; i < 4U; i++)
  {
    t0 = HAL_GetTick();
    ST7796S_FillScreen(fills[i]);
    tft_frame_ms = HAL_GetTick() - t0;
    HAL_Delay(400);
  }
  snprintf(msg, sizeof(msg), "[tft] full-screen fill = %lu ms (%lu kB/s)\r\n",
           (unsigned long)tft_frame_ms,
           (unsigned long)((tft_frame_ms > 0U) ? (300U * 1000U / tft_frame_ms) : 0U));
  Debug_Print(msg);

  /* 3. MADCTL check: the pattern must appear upright in every orientation,
     white border on all four edges, red bar 6th from the left. */
  for (uint8_t r = 0; r < 4U; r++)
  {
    ST7796S_SetRotation(r);
    ST7796S_DrawTestPattern();
    HAL_Delay(800);
  }

  /* 4. Final screen: portrait test pattern + live counters (TFT_AlivePoll) */
  ST7796S_SetRotation(0U);
  ST7796S_DrawTestPattern();
  ST7796S_DrawNumber7(TFT_CNT_X, TFT_FRAME_MS_Y, TFT_CNT_DIGIT_W, TFT_CNT_DIGIT_H,
                      tft_frame_ms, 5U, ST7796S_CYAN, TFT_GREY);
  Debug_Print("[tft] smoke test done, live counters running\r\n");
}

/**
  * @brief  Proof the link stays alive after boot: once a second redraw the
  *         uptime (seconds, cyan digits) and toggle a red/green square in the
  *         grey block. ~2.5 kB per update = ~2 ms at 10 MHz, so it never
  *         stalls the Ethernet main loop. Call every main-loop iteration.
  */
static void TFT_AlivePoll(void)
{
  static uint32_t next_tick = 0;
  static uint8_t  phase = 0;

  if ((int32_t)(HAL_GetTick() - next_tick) < 0)
  {
    return;
  }
  next_tick = HAL_GetTick() + 1000U;
  phase ^= 1U;

  ST7796S_FillRect(TFT_BLINK_X, TFT_BLINK_Y, 40U, 40U, phase ? ST7796S_GREEN : ST7796S_RED);
  ST7796S_DrawNumber7(TFT_CNT_X, TFT_UPTIME_Y, TFT_CNT_DIGIT_W, TFT_CNT_DIGIT_H,
                      HAL_GetTick() / 1000U, 5U, ST7796S_CYAN, TFT_GREY);
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
